---
kind: type
id: T:Autodesk.Revit.DB.APIObject
source: html/beb86ef5-39ad-3f0d-0cd9-0c929387a2bb.htm
---
# Autodesk.Revit.DB.APIObject

Supports all objects in the Autodesk Revit API hierarchy.

## Syntax (C#)
```csharp
public class APIObject : IDisposable
```